In [ ]:
Pandas

In [ ]:
1) Series
2) Dataframe

In [1]:
import numpy as np
import pandas as pd

import warnings
warnings.filterwarnings('ignore')

In [2]:
ser = pd.Series()

ser
#print('{}\n',format(ser))

Series([], dtype: float64)

In [3]:
ser = pd.Series([0,10,20,30,40,50,60,70,80,90])

ser

0     0
1    10
2    20
3    30
4    40
5    50
6    60
7    70
8    80
9    90
dtype: int64

In [4]:
#Notice Datatype
ser = pd.Series([5,20.5,'shankar'])

ser

0          5
1       20.5
2    shankar
dtype: object

In [5]:
# create Dictionary
dict = {'A':[1,2,5],'B':[5,8,9], 'C':[1,2,3]}

In [8]:
df = pd.DataFrame(dict)
df

   A  B  C
0  1  5  1
1  2  8  2
2  5  9  3

In [9]:
#Adding single column

df['D'] = [10,25,50]
df

   A  B  C   D
0  1  5  1  10
1  2  8  2  25
2  5  9  3  50

In [11]:
#Add multiple columns in the dataframe (instead of executing above method 2 times)

df = df.assign(E = ['You', 'Can','Add'],F = ['Any', 'Type', 'Values'])
df

   A  B  C   D    E       F
0  1  5  1  10  You     Any
1  2  8  2  25  Can    Type
2  5  9  3  50  Add  Values

In [ ]:
#Unique id registration like (Aadhar, SSN etc.). All column data mandatory, if one missing remove all

In [16]:
dict = {'Name': ['Sam', 'Matthew', 'Reena', np.nan], 'D.O.B' : ['10-1-99','31-04-90',np.nan,'25-12-10'],
        'License':['Yes','No','Yes','Yes']}

In [18]:
unique_id_reg = pd.DataFrame(dict)
unique_id_reg

      Name     D.O.B License
0      Sam   10-1-99     Yes
1  Matthew  31-04-90      No
2    Reena       NaN     Yes
3      NaN  25-12-10     Yes

In [20]:
print("\nDropping any rows with a Nan value\n",'-'*35)

unique_id_reg.dropna(axis=0)

Dropping any rows with a Nan value
 -----------------------------------

      Name     D.O.B License
0      Sam   10-1-99     Yes
1  Matthew  31-04-90      No

In [21]:
relay_qualification = pd.DataFrame({'Team_1':['Raj','Asif','Prem','Akshay'],
                                   'Team_2':[np.nan,'Harry','Sam',np.nan],
                                   'Team_3':[np.nan,'Abid','Mike','Max'],
                                   'Team_4':['Virat','John','Warner','Stailin']})

In [22]:
relay_qualification

   Team_1 Team_2 Team_3   Team_4
0     Raj    NaN    NaN    Virat
1    Asif  Harry   Abid     John
2    Prem    Sam   Mike   Warner
3  Akshay    NaN    Max  Stailin

In [23]:
print("\nDropping any rows with a Nan value\n",'-'*35)

relay_qualification.dropna(axis=1)

Dropping any rows with a Nan value
 -----------------------------------

   Team_1   Team_4
0     Raj    Virat
1    Asif     John
2    Prem   Warner
3  Akshay  Stailin

In [24]:
relay_qualification

   Team_1 Team_2 Team_3   Team_4
0     Raj    NaN    NaN    Virat
1    Asif  Harry   Abid     John
2    Prem    Sam   Mike   Warner
3  Akshay    NaN    Max  Stailin

Filling null(Nan)/Missing values

In [28]:
#Nan manipulation

dict = {'test_1':[1,2,np.nan],'test_2':[5,np.nan,np.nan],'test_3':[1,2,3]}
df=pd.DataFrame(dict)
df

   test_1  test_2  test_3
0     1.0     5.0       1
1     2.0     NaN       2
2     NaN     NaN       3

In [29]:
print("\nFilling values with a default value\n",'-'*35,sep='')
df.fillna(value=50)

Filling values with a default value
-----------------------------------

   test_1  test_2  test_3
0     1.0     5.0       1
1     2.0    50.0       2
2    50.0    50.0       3

In [35]:
#dataframe remains same Will see how we can save the DataFrame later
df

   test_1  test_2  test_3
0     1.0     5.0       1
1     2.0     NaN       2
2     NaN     NaN       3

In [39]:
print('\nFilling values with a computed value (mean of column C here)\n','-'*60,sep='')
df.fillna(value=df['test_3'].mean(),inplace=True)
df

Filling values with a computed value (mean of column C here)
------------------------------------------------------------

   test_1  test_2  test_3
0     1.0     5.0       1
1     2.0     2.0       2
2     2.0     2.0       3